Revit 2026 API

# DockableFrameVisibilityChangedEventArgs Properties

---

The DockableFrameVisibilityChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | DockableFrameShown | True if the pane is being shown, false if it is being hidden. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | PaneId | The identifier for dockable pane. |

#### Reference

DockableFrameVisibilityChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace